tap "farion1231/ccswitch"
tap "oven-sh/bun"
brew "atuin"
brew "bat"
brew "cliproxyapi", restart_service: :changed
brew "curl"
brew "direnv"
brew "eza"
brew "fd"
brew "fish"
brew "fzf"
brew "gh"
brew "git"
brew "git-lfs"
brew "gnu-sed"
brew "go"
brew "grep"
brew "jq"
brew "mani"
brew "node"
brew "pnpm"
brew "python@3.14"
brew "ripgrep"
brew "rust"
brew "stow"
brew "tea"
brew "tmux"
brew "uv"
brew "wget"
brew "zoxide"
brew "zsh"
brew "oven-sh/bun/bun"
cask "1password"
cask "1password-cli"
cask "betterdisplay"
cask "farion1231/ccswitch/cc-switch"
cask "claude-code"
cask "codex"
cask "codex-app"
cask "docker-desktop"
cask "google-chrome"
cask "iina"
cask "iterm2"
cask "obsidian"
cask "raycast"
cask "snipaste"
cask "squirrel-app"
cask "visual-studio-code"
cask "xcodes-app"
vscode "anthropic.claude-code"
vscode "github.copilot-chat"
vscode "openai.chatgpt"
vscode "tamasfe.even-better-toml"
