tap "farion1231/ccswitch"

brew "atuin"
brew "bat"
brew "bun"
brew "curl"
brew "direnv"
brew "eza"
brew "fd"
brew "fish"
brew "fzf"
brew "git"
brew "gh"
brew "git-lfs"
brew "gnu-sed"
brew "go"
brew "grep"
brew "gnu-stow"
brew "jq"
brew "node"
brew "pnpm"
brew "python"
brew "ripgrep"
brew "rust"
brew "wget"
brew "zoxide"
brew "zsh"
brew "1password-cli"

cask "1password"
cask "betterdisplay"
cask "farion1231/ccswitch/cc-switch"
cask "codex-app"
cask "docker-desktop"
cask "google-chrome"
cask "iina"
cask "iterm2"
cask "obsidian"
cask "raycast"
cask "snipaste"
cask "squirrel-app"
cask "visual-studio-code"
cask "xcodes-app"